{
  "data": {
    "setting": {
      "data": {
        "id": "1",
        "attributes": {
          "blogName": "André Carvalho",
          "blogDescription": "Blog feito para publicações automáticas via chatGPT",
          "logo": {
            "data": {
              "id": "5",
              "attributes": {
                "alternativeText": null,
                "url": "https://res.cloudinary.com/dxcyn87v8/image/upload/v1687523831/andre_carvalho_4ae4bade8a.jpg"
              }
            }
          },
          "menuLink": [
            {
              "id": "1",
              "link": "texto",
              "text": "texto",
              "newTab": false
            }
          ],
          "text": "<strong>Feito por André Carvalho</strong>"
        }
      }
    },
    "posts": {
      "data": [
        {
          "id": "1",
          "attributes": {
            "title": "Meu primeiro post",
            "slug": "meu-primeiro-post",
            "except": "Esse é o primeiro post feito em aula do Curso de React do Otávio Miranda, criando um blog com back-end no strapi e front end em react",
            "createdAt": "2023-06-02T12:56:10.852Z",
            "content": "🚀 Meu primeiro post no Curso de React do Otávio Miranda! 🎓\n\nOlá a todos! Estou super empolgado em compartilhar com vocês o meu primeiro projeto desenvolvido durante as aulas do Curso de React, ministrado pelo incrível Otávio Miranda. Nesta jornada, estou aprendendo a criar um blog com back-end no strap e front-end em React.\n\nPara quem não está familiarizado, o React é uma biblioteca JavaScript extremamente popular e poderosa para a criação de interfaces de usuário interativas. Com sua abordagem baseada em componentes reutilizáveis, o React torna o desenvolvimento de aplicações web mais eficiente e eficaz.\n\nNo curso, temos a oportunidade de mergulhar profundamente no mundo do React e aprender os fundamentos essenciais para a construção de aplicações web modernas. Através das instruções detalhadas e exemplos práticos fornecidos pelo Otávio Miranda, estou aprendendo a desenvolver projetos incríveis e funcionais.\n\nNo meu primeiro projeto, estou criando um blog. Mas aqui está a parte interessante: estamos utilizando um back-end no strapi, uma tecnologia poderosa que nos permite construir a infraestrutura necessária para o blog. Combinando-o com o front-end em React, podemos criar uma experiência de usuário perfeita e interativa.\n\nA criação de um blog com essa arquitetura me permite explorar e aplicar conceitos avançados de React, como roteamento, gerenciamento de estado e interação com APIs. Estou aprendendo a construir componentes reutilizáveis, lidar com rotas dinâmicas e integrar o front-end com o back-end de forma eficiente.\n\nAo longo do curso, compartilharei minha jornada de aprendizado, insights interessantes e os desafios que encontro durante o desenvolvimento do meu projeto. Também estarei à disposição para responder a quaisquer perguntas que vocês possam ter e espero que possamos trocar conhecimentos e experiências valiosas.\n\nAgradeço ao Otávio Miranda pela sua dedicação em ensinar e compartilhar seu conhecimento de forma clara e envolvente. Estou ansioso para explorar mais sobre o React e criar projetos incríveis durante este curso.\n\nFiquem ligados para atualizações sobre o meu projeto do blog em React! Vamos embarcar nessa jornada de aprendizado e construção juntos. 🚀💻\n\n#CursoDeReact #BlogComStrap #FrontEndReact #Aprendizado #DesenvolvimentoWeb",
            "cover": {
              "data": {
                "id": "2",
                "attributes": {
                  "alternativeText": "beautiful view",
                  "url": "https://res.cloudinary.com/dxcyn87v8/image/upload/v1685711665/beautiful_view_greenery_bridge_forest_perfect_background_181624_17827_814287f2a3.avif"
                }
              }
            },
            "categories": {
              "data": [
                {
                  "id": "5",
                  "attributes": {
                    "displayName": "React",
                    "slug": "react"
                  }
                },
                {
                  "id": "4",
                  "attributes": {
                    "displayName": "JavaScript",
                    "slug": "java-script"
                  }
                }
              ]
            },
            "tags": {
              "data": [
                {
                  "id": "1",
                  "attributes": {
                    "displayName": "useState",
                    "slug": "use-state"
                  }
                }
              ]
            },
            "author": {
              "data": {
                "id": "1",
                "attributes": {
                  "displayName": "André Carvalho",
                  "slug": "andre-carvalho"
                }
              }
            }
          }
        },
        {
          "id": "2",
          "attributes": {
            "title": "Segundo Post",
            "slug": "segundo-post",
            "except": "Post teste",
            "createdAt": "2023-06-19T17:23:58.851Z",
            "content": "📢 Novo Post: A Evolução do Desenvolvimento Web: React e Strapi - Uma Combinação Poderosa! 🚀\n\nOlá, comunidade! Estamos de volta com mais um emocionante post sobre o incrível mundo do desenvolvimento web. Hoje, vamos explorar a evolução contínua dessa área e destacar a combinação poderosa do React e do Strapi.\n\n💡 Desenvolvimento Web em Constante Evolução\n\nO desenvolvimento web tem testemunhado uma rápida evolução nos últimos anos, impulsionado pela demanda por aplicativos web interativos e escaláveis. Nesse contexto, o React, uma biblioteca JavaScript desenvolvida pelo Facebook, emergiu como uma das principais escolhas para a criação de interfaces de usuário dinâmicas e responsivas.\n\n🚀 React: A Força Impulsionadora\n\nO React conquistou o coração dos desenvolvedores com sua abordagem inovadora de construção de interfaces de usuário. Sua arquitetura baseada em componentes permite a criação de UIs reutilizáveis, o que aumenta a eficiência do desenvolvimento e facilita a manutenção do código.\n\nAlém disso, o React se destaca pela sua capacidade de renderizar apenas as partes da interface que foram alteradas, tornando os aplicativos mais rápidos e responsivos. Essa eficiência é essencial, especialmente em tempos onde a performance é um fator determinante para o sucesso de um aplicativo.\n\n⚙️ Strapi: Capacitando o Gerenciamento de Conteúdo\n\nEnquanto o React brilha na parte front-end, o Strapi entra em ação no back-end, oferecendo uma plataforma poderosa para o gerenciamento de conteúdo. O Strapi permite criar e personalizar modelos de dados complexos de forma intuitiva, tornando o processo de gerenciamento de conteúdo uma tarefa ágil e eficiente.\n\nCom o Strapi, é possível definir tipos de conteúdo, como posts, páginas, produtos, e muito mais. Também é possível criar relacionamentos entre esses tipos de conteúdo, garantindo a flexibilidade necessária para atender às necessidades específicas de um projeto.\n\n💪 A Combinação Perfeita: React + Strapi\n\nAgora, imagine unir essas duas forças - React e Strapi - em um único projeto. A combinação é simplesmente poderosa! Com o React, você pode criar uma interface de usuário dinâmica e interativa que se conecta perfeitamente ao back-end do Strapi.\n\nEssa integração perfeita permite a criação de aplicativos web completos, como blogs, lojas virtuais, painéis de administração e muito mais. O poder do React e a flexibilidade do Strapi se complementam, proporcionando uma experiência de desenvolvimento web incrível.\n\n🌟 Seja um Desenvolvedor Web de Sucesso\n\nSe você está buscando se destacar no mundo do desenvolvimento web, dominar o React e o Strapi é um passo crucial. Combinando essas tecnologias, você estará preparado para criar aplicativos modernos, escaláveis e repletos de recursos.\n\nEntão, junte-se a nós nessa jornada de aprendizado e comece a explorar as possibilidades infinitas do desenvolvimento web com React e Strapi. Esteja pronto para impulsionar sua carreira e construir projetos incríveis.\n\nContinue nos acompanhando",
            "cover": {
              "data": {
                "id": "4",
                "attributes": {
                  "alternativeText": null,
                  "url": "https://res.cloudinary.com/dxcyn87v8/image/upload/v1687195106/ceu_pastel_fundo_bonito_fundo_romantico_fundo_sonhador_130147_1254_fd46889dd5.avif"
                }
              }
            },
            "categories": {
              "data": [
                {
                  "id": "3",
                  "attributes": {
                    "displayName": "Estudos",
                    "slug": "estudos"
                  }
                },
                {
                  "id": "5",
                  "attributes": {
                    "displayName": "React",
                    "slug": "react"
                  }
                }
              ]
            },
            "tags": {
              "data": [
                {
                  "id": "1",
                  "attributes": {
                    "displayName": "useState",
                    "slug": "use-state"
                  }
                }
              ]
            },
            "author": {
              "data": {
                "id": "2",
                "attributes": {
                  "displayName": "ChatGPT",
                  "slug": "chat-gpt"
                }
              }
            }
          }
        },
        {
          "id": "3",
          "attributes": {
            "title": "FullPost",
            "slug": "full-post",
            "except": "Full post description",
            "createdAt": "2023-06-20T14:18:12.452Z",
            "content": "<p>Nostro <strong>definitiones</strong> (<i>React</i>) sed cu - <u>Otávio Miranda</u>. Sea <code>useEffect</code>, useState dicat fabulas <a href=\"https://gist.github.com/luizomf/e7cf0c3d172801225cce694681ecb0ad\">consetetur</a> no, odio deseruisse assueverit mei eu, vis probo nonumes molestie id. Ipsum movet liberavisse an mea, diceret vituperata ne his, delenit apeirian quo ea. Imperdiet percipitur te eos. Per ludus aliquam cu. <a href=\"https://gist.github.com/luizomf/e7cf0c3d172801225cce694681ecb0ad\">Eos ex tincidunt necessitatibus, timeam theophrastus mel cu</a>. La.</p>\n<h1>Tincidunt necessitatibus, timeam theophrastus mel cu</h1>\n<h2>Tincidunt necessitatibus, timeam theophrastus mel cu</h2>\n<h3>Tincidunt necessitatibus, timeam theophrastus mel cu</h3>\n<h4>Tincidunt necessitatibus, timeam theophrastus mel cu</h4>\n<h5>Tincidunt necessitatibus, timeam theophrastus mel cu</h5>\n<h6>Tincidunt necessitatibus, timeam theophrastus mel cu</h6>\n<pre><code class=\"language-plaintext\">\nimport { HtmlContent } from '../HtmlContent';\nimport * as Styled from './styles';\nexport type FooterProps = {\n  footerHtml: string;\n};\nexport const Footer = ({ footerHtml }: FooterProps) => {\n  return (\n    Styled.Container;\n      HtmlContent html={footerHtml} ;\n   /Styled.Container>;\n  );\n};\n</code></pre>\n<p>Qui eu <i>mutat</i> exerci <span style=\"background-color:hsl(60,75%,60%);\">dolores</span>, his no <span style=\"color:hsl(270,75%,60%);\">repudiare</span> constituam <s>accommodare</s>, vis ea sint <u>tempor</u> eirmod. In mei eruditi moderatius, ex per iudico essent repudiandae. In vis vidisse menandri, an has repudiare disputationi delicatissimi. In has wisi justo postulant. Ei viderer ornatus mel, usu an partiendo tincidunt, ea eum brute ullamcorper.</p><p>10<sup>2</sup>*5<sup>2</sup> - H<sub>2</sub>0</p><p style=\"text-align:center;\"><strong>Center: </strong>Abhorreant reformidans eum an, per equidem repudiandae no, ex cum elitr argumentum persequeris. In eam consul theophrastus delicatissimi, lobortis rationibus efficiendi mea ei, nam natum dolore scripserit ea. Sit partiendo eloquentiam ne. Sea no autem dolores, ridens gloriatur mel cu. Munere nullam epicuri his id, dicam definiebas deterruisset eu vim. Ea veritus deleniti usu, nam ei idque choro volumus, ex nisl aliquam bonorum eam.</p><p>Fugit aliquip erroribus eu eam, an mel vidit doctus. Vis nobis veritus maluisset id, nonumy adversarium neglegentur est ut. Tation persius pri eu, modo minim fastidii mei no. Ad tota pertinax definiebas eam.</p><p style=\"text-align:right;\"><strong>Right:</strong> Mel in lorem feugiat, tation dolore et eum. Id has utamur albucius molestiae. Dico justo maiestatis ei mei, labitur laboramus voluptatum nam ut. Saperet propriae nec an.</p><p>Quod oblique mei ne, cetero delicatissimi sea cu, cu est harum dicit verterem. Tota forensibus ut usu, luptatum dignissim persecuti vel ex. Mea nostrud instructior cu, et referrentur theophrastus eum. Pro in iuvaret senserit. In persius explicari conceptam nec, in populo ponderum consequat vis. Gloriatur conclusionemque no qui, vitae nominati nec te, laoreet torquatos accommodare ex qui. Eu natum mediocritatem eos, cum ex alia oportere.</p><p style=\"text-align:justify;\"><strong>Justify:</strong> Cu vis nonumes petentium disputationi, invidunt aliquando ex ius, ocurreret suscipiantur conclusionemque eu qui. Probo nemore ut est. Et eam dicta oratio eligendi. Quem dicta dolore vel et, at reque gloriatur definitionem sed.</p><p>Nec simul ullamcorper at. Mea possit dolores persecuti te, ei quidam apeirian quo. Has quas corpora ne. Ius ad malis iusto delenit, sit ferri idque ex.</p><blockquote><p>Blockquote: Et sed legere rationibus, vitae evertitur ad eam. Eu amet vero officiis vis. Ad nullam pericula neglegentur sit, vix ei regione legendos argumentum. Mei an quas convenire, nobis dicunt mei ut. Pro no debet referrentur, ei est falli libris. Eu per summo salutandi hendrerit, salutatus democritum interesset nec ut. Wisi lobortis incorrupte ei mea, explicari interpretaris has et.</p></blockquote><p>A new line:</p><hr><p>Now keep going…</p><figure class=\"image\"><a href=\"https://gist.github.com/luizomf/e7cf0c3d172801225cce694681ecb0ad\"><img src=\"https://res.cloudinary.com/dlizakp2a/image/upload/v1614696630/Frozen_sunset_on_the_lake_by_Manuel_Arslanyan_9f9cd8ea10.jpg\" alt=\"O alt text da imagem\"></a><figcaption>Aqui está uma imagem</figcaption></figure><p>Munere euripidis an sed, usu ne consul soluta utamur. Bonorum equidem placerat eu cum, tantas quidam duo et. Pro soleat quaestio ne, ut nam wisi vocibus inciderint, ex his maiorum mnesarchum. Et est wisi primis, id vel odio alienum voluptatibus. Veri doctus offendit vim ea. Has nemore prompta inciderint ei, no sea expetendis dissentiet. Copiosae delicatissimi an sea, id cum agam clita nostro, tale tincidunt delicatissimi ei eos.</p><figure class=\"image image-style-side\"><img src=\"https://res.cloudinary.com/dlizakp2a/image/upload/v1614696630/Frozen_sunset_on_the_lake_by_Manuel_Arslanyan_9f9cd8ea10.jpg\" alt=\"Uma imagem à direita\"><figcaption>Uma imagem à direita</figcaption></figure><p>Munere euripidis an sed, usu ne consul soluta utamur. Bonorum equidem placerat eu cum, tantas quidam duo et. Pro soleat quaestio ne, ut nam wisi vocibus inciderint, ex his maiorum mnesarchum. Et est wisi primis, id vel odio alienum voluptatibus. Veri doctus offendit vim ea. Has nemore prompta inciderint ei, no sea expetendis dissentiet. Copiosae delicatissimi an sea, id cum agam clita nostro, tale tincidunt delicatissimi ei eos.</p><p>Munere euripidis an sed, usu ne consul soluta utamur. Bonorum equidem placerat eu cum, tantas quidam duo et. Pro soleat quaestio ne, ut nam wisi vocibus inciderint, ex his maiorum mnesarchum. Et est wisi primis, id vel odio alienum voluptatibus. Veri doctus offendit vim ea. Has nemore prompta inciderint ei, no sea expetendis dissentiet. Copiosae delicatissimi an sea, id cum agam clita nostro, tale tincidunt delicatissimi ei eos.</p><p>Solum consul scripserit in duo, an sit postea denique percipit. Facer ignota consequat nec ei, idque etiam corrumpit sit ut. In mucius definitionem quo, vis an nisl diam appellantur, hendrerit comprehensam ea per. Vix saepe fierent ut.</p><p>Cu mei summo copiosae. Et vim quaestio partiendo. Quot praesent imperdiet at duo. Sit probo causae ei. Ad ius nemore eruditi.</p><p>Mei in qualisque disputando. Adipisci philosophia et sed, mel diceret patrioque sententiae ea, iriure posidonium consectetuer ad eam. Nobis reprimique duo in, eam corpora mandamus ex. In quod euismod eum, ne habemus cotidieque necessitatibus cum. Liber recteque duo no, ludus reprehendunt has an.</p><p>Solum consul scripserit in duo, an sit postea denique percipit. Facer ignota consequat nec ei, idque etiam corrumpit sit ut. In mucius definitionem quo, vis an nisl diam appellantur, hendrerit comprehensam ea per. Vix saepe fierent ut.</p><p>Cu mei summo copiosae. Et vim quaestio partiendo. Quot praesent imperdiet at duo. Sit probo causae ei. Ad ius nemore eruditi.</p><p>Mei in qualisque disputando. Adipisci philosophia et sed, mel diceret patrioque sententiae ea, iriure posidonium consectetuer ad eam. Nobis reprimique duo in, eam corpora mandamus ex. In quod euismod eum, ne habemus cotidieque necessitatibus cum. Liber recteque duo no, ludus reprehendunt has an.</p><p>Bullet:</p><ul><li>Mei in qualisque disputando. Adipisci philosophia et sed, mel diceret patrioque sententiae ea, iriure posidonium consectetuer ad eam. Nobis reprimique duo in, eam corpora mandamus ex. In quod euismod eum, ne habemus cotidieque necessitatibus cum. Liber recteque duo no, ludus reprehendunt has an.</li><li>iriure posidonium consectetuer ad eam.</li><li>Nobis reprimique duo in, eam corpora mandamus</li><li>ex. In</li><li>quod euismod</li><li>eum, ne habemus cotidieque necessitatibus cum.</li><li>Liber recteque duo no, ludus reprehendunt has an.</li></ul><p>Now ordered:</p><ol><li>Item 1</li><li>Item</li><li>Item</li><li>Item</li></ol><p>A think that's it…</p><figure class=\"table\"><table><thead><tr><th>Title 1</th><th>Title 1</th><th>Title 1</th><th>Title 1</th><th>Title 1</th><th>Title 1</th><th>Title 1</th><th>Title 1</th><th>Title 1</th><th>Title 1</th></tr></thead><tbody><tr><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td></tr><tr><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td></tr><tr><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td><td>Item</td></tr></tbody></table></figure><p>A video:</p><figure class=\"media\"><oembed url=\"https://www.youtube.com/watch?v=oLmRV25eQvo\"></oembed></figure><p>The end.</p>",
            "cover": {
              "data": {
                "id": "2",
                "attributes": {
                  "alternativeText": "beautiful view",
                  "url": "https://res.cloudinary.com/dxcyn87v8/image/upload/v1685711665/beautiful_view_greenery_bridge_forest_perfect_background_181624_17827_814287f2a3.avif"
                }
              }
            },
            "categories": {
              "data": [
                {
                  "id": "2",
                  "attributes": {
                    "displayName": "Trabalho",
                    "slug": "trabalho"
                  }
                },
                {
                  "id": "5",
                  "attributes": {
                    "displayName": "React",
                    "slug": "react"
                  }
                },
                {
                  "id": "4",
                  "attributes": {
                    "displayName": "JavaScript",
                    "slug": "java-script"
                  }
                },
                {
                  "id": "3",
                  "attributes": {
                    "displayName": "Estudos",
                    "slug": "estudos"
                  }
                }
              ]
            },
            "tags": {
              "data": [
                {
                  "id": "2",
                  "attributes": {
                    "displayName": "useEffect",
                    "slug": "use-effect"
                  }
                },
                {
                  "id": "1",
                  "attributes": {
                    "displayName": "useState",
                    "slug": "use-state"
                  }
                }
              ]
            },
            "author": {
              "data": {
                "id": "1",
                "attributes": {
                  "displayName": "André Carvalho",
                  "slug": "andre-carvalho"
                }
              }
            }
          }
        }
      ]
    }
  }
}
